_Rarzrabotki/Rarus/USO2/Documents/УПН_РасторжениеСделкиПоНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РасторжениеСделкиПоНедвижимости</Name>
			<BasedOn>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости</xr:Item>
				<xr:Item>InformationRegister.УСОERP_СоответствиеДоговоровИДолей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_СтатусыДокументовПоСделке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоНедвижимости</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УПН_ДоговорПоНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРасторжения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозврата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Санкции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/АналитикаУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаПоПартнерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УПН_РасчетыСКлиентамиПоОбъектамНедвижимости</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/КлючиАналитикиУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>КлючиАналитикиУчетаПоПартнерам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РасторжениеСделкиПоНедвижимости/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Общее

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПартнераСервер()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание") И НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТипЗнч(Параметры.Основание) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если  НЕ Параметры.Основание.УСОERP_ДоговорДолевогоСтроительства Тогда
				Отказ = Истина;
				Сообщить("Для ввода документа ""Расторжение сделки по недвижимости"" необходим договор долевого строительства!");
				Возврат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.УПН_ДоговорПоНедвижимости")
			И ЗначениеЗаполнено(Параметры.Основание)
			И Параметры.Основание.Проведен Тогда
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
			Сообщить("Для ввода документа ""Расторжение сделки по недвижимости"" необходим проведенный документ-основание ""Договор по недвижимости""!");
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСуммуКВозвратуСУчетомСанкции();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	ПриИзмененииПартнераСервер();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыНедвижимостиНаСервере()
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(АналитикаУчетаПоПартнерам.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)) КАК КлючАналитики,
		|	ТЧ_ОбъектыНедвижимости.Ссылка.Договор,
		|	ТЧ_ОбъектыНедвижимости.Ссылка.ВалютаВзаиморасчетов,
		|	ТЧ_ОбъектыНедвижимости.ОбъектНедвижимости,
		|	ТЧ_ОбъектыНедвижимости.Сумма КАК СуммаВозврата
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	Документ.УПН_ДоговорПоНедвижимости.ОбъектыНедвижимости КАК ТЧ_ОбъектыНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|		ПО ТЧ_ОбъектыНедвижимости.Ссылка.Партнер = АналитикаУчетаПоПартнерам.Партнер
		|			И ТЧ_ОбъектыНедвижимости.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
		|			И ТЧ_ОбъектыНедвижимости.Ссылка.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
		|			И ТЧ_ОбъектыНедвижимости.Ссылка.Договор = АналитикаУчетаПоПартнерам.Договор
		|			И ТЧ_ОбъектыНедвижимости.Ссылка.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
		|ГДЕ
		|	ТЧ_ОбъектыНедвижимости.Ссылка = &ДоговорПоНедвижимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.ОбъектНедвижимости,
		|	СУММА(ДанныеДокумента.СуммаВозврата - ЕСТЬNULL(РасчетыПоОбъектамНедвижимостиОбороты.СуммаРасход, 0)) КАК СуммаВозврата
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Обороты(
		|				,
		|				&КонецПериода,
		|				Регистратор,
		|				(АналитикаУчетаПоПартнерам, Договор, Валюта, ОбъектНедвижимости) В
		|					(ВЫБРАТЬ
		|						ДанныеДокумента.КлючАналитики,
		|						ДанныеДокумента.Договор,
		|						ДанныеДокумента.ВалютаВзаиморасчетов,
		|						ДанныеДокумента.ОбъектНедвижимости
		|					ИЗ
		|						ДанныеДокумента КАК ДанныеДокумента)) КАК РасчетыПоОбъектамНедвижимостиОбороты
		|		ПО ДанныеДокумента.КлючАналитики = РасчетыПоОбъектамНедвижимостиОбороты.АналитикаУчетаПоПартнерам
		|			И ДанныеДокумента.Договор = РасчетыПоОбъектамНедвижимостиОбороты.Договор
		|			И ДанныеДокумента.ОбъектНедвижимости = РасчетыПоОбъектамНедвижимостиОбороты.ОбъектНедвижимости
		|			И ДанныеДокумента.ВалютаВзаиморасчетов = РасчетыПоОбъектамНедвижимостиОбороты.Валюта
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.ОбъектНедвижимости
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеДокумента.СуммаВозврата - ЕСТЬNULL(РасчетыПоОбъектамНедвижимостиОбороты.СуммаРасход, 0)) <> 0";
		//|	И РасчетыПоОбъектамНедвижимостиОбороты.Регистратор <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДоговорПоНедвижимости", 	Объект.ДоговорПоНедвижимости);
	Запрос.УстановитьПараметр("Ссылка"               , 	Объект.Ссылка);
	Запрос.УстановитьПараметр("КонецПериода"         ,  Новый Граница(Объект.Дата,ВидГраницы.Исключая));  	
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОбъектыНедвижимости.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбъектыНедвижимости(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДоговорПоНедвижимости) Тогда
		ЗаполнитьОбъектыНедвижимостиНаСервере();
		ОбновитьСуммуКВозвратуСУчетомСанкции();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуКВозвратуСУчетомСанкции()
	Для Каждого стр из Объект.ОбъектыНедвижимости Цикл
		стр.Квозврату = стр.СуммаВозврата - стр.Санкции;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьСуммуКВозвратуСУчетомСанкции();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиСанкцииПриИзменении(Элемент)
	ОбновитьСуммуКВозвратуСУчетомСанкции();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиСуммаВозвратаПриИзменении(Элемент)
	
	ОбновитьСуммуКВозвратуСУчетомСанкции(); 
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиКВозвратуПриИзменении(Элемент)
	ТекСтрока = Элементы.ОбъектыНедвижимости.ТекущиеДанные;
	ТекСтрока.СуммаВозврата = ТекСтрока.Санкции+ТекСтрока.КВозврату;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект); 	

КонецПроцедуры

&НаСервере
Процедура ОбъектыНедвижимостиОбъектНедвижимостиПриИзмененииНаСервере(ИдСтроки)
	
	ТекСтрока = Объект.ОбъектыНедвижимости.НайтиПоИдентификатору(ИдСтроки);
	ТекСтрока.СуммаВозврата = Объект.ДоговорПоНедвижимости.ОбъектыНедвижимости.Выгрузить().Скопировать(Новый Структура("ОбъектНедвижимости",ТекСтрока.ОбъектНедвижимости)).Итог("Сумма");
	ТекСтрока.КВозврату = ТекСтрока.СуммаВозврата-ТекСтрока.Санкции;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНедвижимостиОбъектНедвижимостиПриИзменении(Элемент)
	ОбъектыНедвижимостиОбъектНедвижимостиПриИзмененииНаСервере(Элементы.ОбъектыНедвижимости.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

#КонецОбласти
